# Данные для улиц
streets = {
    "Улица Щетинкина": {
        "markers": [


            {"name": 'Проективное покрытие: 60%<br/>Высота газона: 0.3 см"', "coords": [53.718503, 91.444637]},
            {"name": 'Проективное покрытие: 50%<br/>Высота газона: 0.4 см"', "coords": [53.719195, 91.44444]},
            {"name": "Проективное покрытие: 30%<br/>Высота газона: -0.5 см", "coords": [53.721958, 91.443528]},
            {"name": 'Проективное покрытие: 80%<br/>Высота газона: 0.5 см"', "coords": [53.72311, 91.443088]},
            {"name": "Проективное покрытие: 90%<br/>Высота газона: 0.3 см", "coords": [53.723316, 91.442943]},
            {"name": "Проективное покрытие: 80%<br/>Высота газона: 0.2 см", "coords": [53.719864, 91.444278]},
            {"name": 'Проективное покрытие: 80%<br/>Высота газона: 0.4 см"', "coords": [53.723641, 91.442863]},
            {"name": "Проективное покрытие: 60%<br/>Высота газона: 0.2 см", "coords": [53.724527, 91.44266]},
            {"name": "Проективное покрытие: 40%<br/>Высота газона: -0.5 см", "coords": [53.726095, 91.442138]},
            {"name": 'Проективное покрытие: 30%<br/>Высота газона: -0.5 см"', "coords": [53.733403, 91.440291]},
            {"name": "Проективное покрытие: 20%<br/>Высота газона: -0.5 см", "coords": [53.72639, 91.442279]},
            {"name": "Проективное покрытие: 50%<br/>Высота газона: 0.2 см", "coords": [53.726778, 91.442095]},
            {"name": 'Проективное покрытие: 40%<br/>Высота газона: 0.4 см"', "coords": [53.728001, 91.441852]},
            {"name": "Проективное покрытие: 60%<br/>Высота газона: 0.6 см", "coords": [53.728537, 91.441666]},
            {"name": "Проективное покрытие: 50%<br/>Высота газона: 0.4 см", "coords": [53.728927, 91.441489]},
            {"name": 'Проективное покрытие: 80%<br/>Высота газона: 0.5 см"', "coords": [53.729375, 91.441349]},
            {"name": "Проективное покрытие: 70%<br/>Высота газона: 0.4 см", "coords": [53.729631, 91.441326]},
            {"name": "Проективное покрытие: 50%<br/>Высота газона: 0.2 см", "coords": [53.730208, 91.441166]},
            {"name": 'Проективное покрытие: 60%<br/>Высота газона: -0.3 см"', "coords": [53.730732, 91.440973]},
            {"name": "Проективное покрытие: 70%<br/>Высота газона: 0.3 см", "coords": [53.732075, 91.440609]},
            {"name": "Проективное покрытие: 90%<br/>Высота газона: -0.4 см", "coords": [53.734712, 91.439852]},
            {"name": 'Проективное покрытие: 100%<br/>Высота газона: 0.2 см"', "coords": [53.717726, 91.445442]},
            {"name": "Проективное покрытие: 90%<br/>Высота газона: 0.7 см", "coords": [53.718163, 91.445271]},
            {"name": "Проективное покрытие: 50%<br/>Высота газона: 0.3 см", "coords": [53.718610, 91.445244]},
            {"name": 'Проективное покрытие: 90%<br/>Высота газона: 0.5 см"', "coords": [53.719983, 91.444639]},
            {"name": "Проективное покрытие: 100%<br/>Высота газона: 0.2 см", "coords": [53.721045, 91.444195]},
            {"name": "Проективное покрытие: 80%<br/>Высота газона: 0.3 см", "coords": [53.721353, 91.444081]},
            {"name": 'Проективное покрытие: 70%<br/>Высота газона: 0.3 см"', "coords": [53.721641, 91.443956]},
            {"name": "Проективное покрытие: 70%<br/>Высота газона: -0.4 см", "coords": [53.722021, 91.443862]},
            {"name": "Проективное покрытие: 20%<br/>Высота газона: -0.5 см", "coords": [53.722553, 91.443728]},
            {"name": 'Проективное покрытие: 30%<br/>Высота газона: -0.3 см"', "coords": [53.722873, 91.44358]},
            {"name": "Проективное покрытие: 20%<br/>Высота газона: -0.4 см", "coords": [53.723211, 91.443494]},
            {"name": "Проективное покрытие: 30%<br/>Высота газона: -0.3 см", "coords": [53.723485, 91.443392]},
            {"name": 'Проективное покрытие: 90%<br/>Высота газона: 0.5 см"', "coords": [53.72379, 91.443329]},
            {"name": "Проективное покрытие: 30%<br/>Высота газона: -0.3 см", "coords": [53.722873, 91.44358]},
            {"name": "Проективное покрытие: 90%<br/>Высота газона: 0.4 см", "coords": [53.724078, 91.443227]},
            {"name": "Проективное покрытие: 80%<br/>Высота газона: 0.3 см", "coords": [53.724323, 91.443133]},
            {"name": "Проективное покрытие: 50%<br/>Высота газона: -0.4 см", "coords": [53.724638, 91.443094]},
            {"name": "Проективное покрытие: 30%<br/>Высота газона: -0.5 см", "coords": [53.724907, 91.442985]},
            {"name": 'Проективное покрытие: 20%<br/>Высота газона: -0.5 см"', "coords": [53.725287, 91.442875]},
            {"name": "Проективное покрытие: 50%<br/>Высота газона: 0.3 см", "coords": [53.725875, 91.442734]},
            {"name": "Проективное покрытие: 40%<br/>Высота газона: -0.4 см", "coords": [53.726135, 91.442671]},
            {"name": 'Проективное покрытие: 60%<br/>Высота газона: 0.5 см"', "coords": [53.726751, 91.442491]},
            {"name": "Проективное покрытие: 70%<br/>Высота газона: 0.4 см", "coords": [53.727261, 91.442327]},
            {"name": "Проективное покрытие: 50%<br/>Высота газона: -0.3 см", "coords": [53.727716, 91.442225]},
            {"name": 'Проективное покрытие: 80%<br/>Высота газона: 0.4 см"', "coords": [53.728161, 91.442092]},
            {"name": "Проективное покрытие: 100%<br/>Высота газона: 0.3 см", "coords": [53.728803, 91.441927]},
            {"name": "Проективное покрытие: 70%<br/>Высота газона: 0.2 см", "coords": [53.729604, 91.441653]},
            {"name": "Проективное покрытие: 30%<br/>Высота газона: -0.4 см", "coords": [53.730119, 91.441606]},
            {"name": "Проективное покрытие: 40%<br/>Высота газона: -0.3 см", "coords": [53.731046, 91.441324]},
            {"name": 'Проективное покрытие: 70%<br/>Высота газона: 0.3 см"', "coords": [53.733742, 91.440565]},

        ],
        "line": [
            [53.726186, 91.44252],
            [53.734935, 91.43993],
            [53.733805, 91.440309],
            [53.727508, 91.442126],
            [53.7248349, 91.442895],
            [53.724819, 91.442882],
            [53.722302, 91.44362],
            [53.717319, 91.445112],
        ],
        "htmlcode": '''<h1>Улица Щетинкина</h1>
              <img src="img/2.jpg" width="300px" height="200px">''',
    },
    "Проспект Ленина": {
        "markers": [
            {"name": "Проективное покрытие: 70%<br/>Высота газона: 0.3 см", "coords": [53.721368, 91.433337]},  # л
            {"name": "Проективное покрытие: 90%<br/>Высота газона: 0.3 см", "coords": [53.721287, 91.433376]},  # п
            {"name": "Проективное покрытие: 80%<br/>Высота газона: 0.3 см", "coords": [53.721402, 91.433709]},  # л
            {"name": "Проективное покрытие: 90%<br/>Высота газона: 0.3 см", "coords": [53.721323, 91.433744]},  # п
        ],
        "line": [
            [53.7211, 91.4333],
            [53.722755, 91.4495],
            [53.723056, 91.4539],
            [53.7234, 91.4565],
        ],
        "htmlcode": '''<h1>Проспект Ленина</h1>
              <img src="img/3.jpg" width="300px" height="200px">''',
    },
    "Улица Чертыгашева": {
        "markers": [
            {"name": "Проективное покрытие: 70%<br/>Высота газона: 0.3 см", "coords": [53.723926, 91.432816]},  # л
            {"name": "Проективное покрытие: 100%<br/>Высота газона: 0.3 см", "coords": [53.723793, 91.432967]},  # п
            {"name": "Проективное покрытие: 40%<br/>Высота газона: 0.3 см", "coords": [53.723968, 91.433600]},  # л
            {"name": "Проективное покрытие: 50%<br/>Высота газона: 0.3 см", "coords": [53.723867, 91.433619]},  # п
        ],
        "line": [
            [53.723808, 91.432518],
            [53.724108, 91.435558],
            [53.724206, 91.436697],
            [53.724223, 91.436802],
            [53.724372, 91.437974],
            [53.724412, 91.438316],
            [53.724660, 91.440872],
            [53.724754, 91.441700],
            [53.724843, 91.442738],
            [53.724854, 91.442893],
            [53.724857, 91.442936],
            [53.725037, 91.445045],
            [53.725465, 91.449354],
            [53.725606, 91.450948],
            [53.725824, 91.453085],
            [53.725840, 91.453251],
            [53.725965, 91.454592],
            [53.726027, 91.455169],
        ],
        "htmlcode": '''<h1>Улица Чертыгашева</h1>
              <img src="img/4.jpg" width="300px" height="200px">''',
    },
    "Улица Крылова": {
        "markers": [
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: -4 см.", "coords": [53.7351, 91.4405]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 4 см.", "coords": [53.7349, 91.4405]}, # п
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 3 см.", "coords": [53.7352, 91.4412]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 3 см.", "coords": [53.7350, 91.4413]}, # п
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 4 см.", "coords": [53.7352, 91.4418]}, # л
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: 5 см.", "coords": [53.7350, 91.4418]}, # п
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 2 см.", "coords": [53.7353, 91.4424]}, # л
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 2 см.", "coords": [53.7351, 91.4424]}, # п
            {"name": "Проективное покрытие: 60 %<br/>Высота газона: 2 см.", "coords": [53.7353, 91.4433]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 3 см.", "coords": [53.7352, 91.4433]}, # п
            {"name": "Проективное покрытие: 50 %<br/>Высота газона: 1 см.", "coords": [53.7354, 91.4446]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 2 см.", "coords": [53.7353, 91.4446]}, # п
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 2 см.", "coords": [53.7355, 91.4451]}, # л
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 4 см.", "coords": [53.7353, 91.4451]}, # п
            {"name": "Проективное покрытие: 40 %<br/>Высота газона: -3 см.", "coords": [53.7355, 91.4457]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: -3 см.", "coords": [53.7354, 91.4458]}, # п
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -2 см.", "coords": [53.7355, 91.4457]}, # л
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -4 см.", "coords": [53.7354, 91.4458]}, # п
            {"name": "Проективное покрытие: 30 %<br/>Высота газона: -4 см.", "coords": [53.7356, 91.4461]}, # л
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: 3 см.", "coords": [53.7354, 91.4462]}, # п
            {"name": "Проективное покрытие: 50 %<br/>Высота газона: -3 см.", "coords": [53.7357, 91.4468]}, # л
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -2 см.", "coords": [53.7355, 91.4468]}, # п
            {"name": "Проективное покрытие: 50 %<br/>Высота газона: 2 см.", "coords": [53.7357, 91.4473]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 3 см.", "coords": [53.7355, 91.4474]}, # п
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: 1 см.", "coords": [53.7358, 91.4479]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: -1 см.", "coords": [53.7356, 91.4480]}, # п
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: -3 см.", "coords": [53.7358, 91.4485]}, # л
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: 3 см.", "coords": [53.7357, 91.4486]}, # п
            {"name": "Проективное покрытие: 10 %<br/>Высота газона: -5 см.", "coords": [53.7359, 91.4491]}, # л
            {"name": "Проективное покрытие: 100 %<br/>Высота газона: 2 см.", "coords": [53.7357, 91.4492]}, # п
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 2 см.", "coords": [53.7359,  91.4495]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: -3 см.", "coords": [53.7357,  91.4496]}, # п
            {"name": "Проективное покрытие: 60 %<br/>Высота газона: -4 см.", "coords": [53.7359,  91.4499]}, # л
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -4 см.", "coords": [53.7358,  91.4503]}, # п
            {"name": "Проективное покрытие: 60 %<br/>Высота газона: -3 см.", "coords": [53.7360,  91.4503]}, # л
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: -2 см.", "coords": [53.7359,  91.4516]}, # п
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -5 см.", "coords": [53.7361,  91.4511]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 3 см.", "coords": [53.7360,  91.4519]}, # п
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: -3 см.", "coords": [53.7361,  91.4516]}, # л
            {"name": "Проективное покрытие: 100 %<br/>Высота газона: 3 см.", "coords": [53.7362,  91.4521]}, # л

        ],
        "line": [
            [53.7350, 91.4400],
            [53.7352, 91.4429],
            [53.7353, 91.4441],
            [53.7360, 91.4519],
        ],
        "htmlcode": '''<h1>Улица Крылова</h1>
              <img src="img/1.jpg" width="300px" height="200px">''',
    }
}